---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceType.op_Inequality(Autodesk.Revit.DB.ExternalResourceType,Autodesk.Revit.DB.ExternalResourceType)
source: html/283c9bca-a634-2909-1880-98648064884a.htm
---
# Autodesk.Revit.DB.ExternalResourceType.op_Inequality Method

Compares two ExternalResourceType instances.

## Syntax (C#)
```csharp
public static bool operator !=(
	ExternalResourceType first,
	ExternalResourceType second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.ExternalResourceType`) - The first ExternalResourceType.
- **second** (`Autodesk.Revit.DB.ExternalResourceType`) - The second ExternalResourceType.

## Returns
True if the inputs are different, false if they are identical.